# Taps
tap "homebrew/cask-fonts"
tap "tw93/tap"

# CLI tools
brew "git"
brew "gh"
brew "jq"
brew "fzf"
brew "antidote"
brew "mas"
brew "stow"
brew "opencode"
brew "jj"

# Modern replacements
brew "mise"      # asdf replacement - manages node, bun, etc.
brew "zoxide"    # z replacement - smarter cd
brew "starship"  # pure prompt replacement - fast, customizable
brew "ripgrep"   # grep replacement - faster
brew "eza"       # ls replacement - icons, git status
brew "bat"       # cat replacement - syntax highlighting
brew "fd"        # find replacement - simpler, faster
brew "git-delta" # diff replacement - better git diffs
brew "btop"      # top replacement - better system monitor
brew "procs"     # ps replacement - better process viewer

# Apps (casks)
cask "1password"
cask "font-fira-code"
cask "firefox"
cask "ghostty"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "claude"

# Custom taps
brew "tw93/tap/mole"


