mafredri/zsh-async

asdf
brew
bun
colorize
command-not-found
flutter
gh
golang
pod
tmux

molovo/tipz
rupa/z
sindresorhus/pretty-time-zsh
sindresorhus/pure
Tarrasch/zsh-command-not-found
tarruda/zsh-autosuggestions
zsh-users/zsh-completions
zsh-users/zsh-history-substring-search
zsh-users/zsh-syntax-highlighting
